In [1]:
word = 'grail'
sent = 'a scratch'

In [2]:
word[0]

'g'

In [3]:
sent[0]

'a'

In [4]:
sent[:1]

'a'

In [5]:
sent[-1]

'h'

In [9]:
sent[-7:-1]

'scratc'

In [11]:
sent[2:len(sent)]

'scratch'

In [12]:
sent[-9:-8]

'a'

In [13]:
sent[0:-8]

'a'

In [14]:
sent[-2:-1]

'c'

In [15]:
sent[2:-1]

'scratc'

In [16]:
sent[-7:-1]

'scratc'

In [17]:
s_len = len(sent)
s_len

9

In [18]:
sent[2:s_len]

'scratch'

In [19]:
word[0:3]

'gra'

In [20]:
word[:3]

'gra'

In [21]:
sent[2:]

'scratch'

In [22]:
sent[ : ]

'a scratch'

In [23]:
sent[::2]

'asrth'

In [24]:
"Black Knight".capitalize()

'Black knight'

In [25]:
"It's just a flesh wound".count("u")

2

In [27]:
"Halt! Who goes there?".startswith("Halt")""

True

In [29]:
"coconut".endswith("nut")

True

In [30]:
"It's just a flesh wound".find("u")

6

In [33]:
"It's just a flesh wound".index("u")

6

In [32]:
"It's just a flesh wound".index("tensor")

ValueError: substring not found

In [34]:
"Old women".isalpha()

False

In [35]:
"1219".isdecimal()

True

In [36]:
"i'am 37".isalnum()

False

In [37]:
"Laylaiscute1219".isalnum()

True

In [38]:
"Black Knight".lower()

'black knight'

In [39]:
'Black Knight'.upper()

'BLACK KNIGHT'

In [40]:
"flesh wound!".replace("flesh wound", "scratch")

'scratch!'

In [43]:
" I'am not dead ".strip()

"I'am not dead"

In [44]:
"NI NI NI NI".split(" ")

['NI', 'NI', 'NI', 'NI']

In [45]:
"3,4".partition(',')

('3', ',', '4')

In [46]:
"nine".center(10)

'   nine   '

In [47]:
"9".zfill(5)

'00009'

In [48]:
d1 = '40c'
m1 = "46'"
s1 = '52.837"'
u1 = 'N'

d2 = '73c'
m2 = "58'"
s2 = '26.302"'
u2 = 'W'

" ".join([d1, m1, s1, u1, d2, m2, s2, u2])

'40c 46\' 52.837" N 73c 58\' 26.302" W'

In [49]:
multi_str = """Guard: What? Ridden en a horse?
King Arthur: Yes!
Guard: You're using coconuts!
King Arthur: What?
Guard: You've Got .. coconuts[s] and you're banagin's together
"""

In [50]:
multi_str.splitlines()

['Guard: What? Ridden en a horse?',
 'King Arthur: Yes!',
 "Guard: You're using coconuts!",
 'King Arthur: What?',
 "Guard: You've Got .. coconuts[s] and you're banagin's together"]

In [51]:
multi_str.splitlines()[::2]

['Guard: What? Ridden en a horse?',
 "Guard: You're using coconuts!",
 "Guard: You've Got .. coconuts[s] and you're banagin's together"]

In [53]:
multi_str.replace("Guard", "Lumine").splitlines()[::2]

['Lumine: What? Ridden en a horse?',
 "Lumine: You're using coconuts!",
 "Lumine: You've Got .. coconuts[s] and you're banagin's together"]

In [54]:
var = 'flesh wound'
s = "It's just a {}!"

In [55]:
s.format(var)

"It's just a flesh wound!"

In [56]:
s.format('Microsoft')

"It's just a Microsoft!"

In [58]:
"""Black Knight: 'Tis But a {0}.
King Arthur: A {0}? Your arm's off!
""".format("Scratch")

"Black Knight: 'Tis But a Scratch.\nKing Arthur: A Scratch? Your arm's off!\n"

In [59]:
"Hayden Planetraium Coordinates {lat}, {lon}".format(lat = '40.8715c', lon = '73.9733c')

'Hayden Planetraium Coordinates 40.8715c, 73.9733c'

In [62]:
'some digits of pi {}'.format(3.14159265359)

'some digits of pi 3.14159265359'

In [63]:
"In 2005, Lu Chao of China recited {:,} digits of pi".format(67890)

'In 2005, Lu Chao of China recited 67,890 digits of pi'

In [64]:
'I remember {0:.4} or {0:.4%} of what Lu Chao recited'.format(7/67890)

'I remember 0.0001031 or 0.0103% of what Lu Chao recited'

In [65]:
'My id code is {0:06d}'.format(12)

'My id code is 000012'

In [66]:
'I know only %d digits of pi' % 7

'I know only 7 digits of pi'

In [67]:
'Some digits of %(cont)s: %(value).2f' % ({'cont':'e','value':2.718})

'Some digits of e: 2.72'

In [68]:
var = 'flesh wound'
f"It's just a {var}"

"It's just a flesh wound"

In [69]:
lat = '40.7815cN'
lon = '73.9733oN'

In [70]:
f"Hayden Planetarium Coordinates : {lat}, {lon}"

'Hayden Planetarium Coordinates : 40.7815cN, 73.9733oN'

In [71]:
test = 'I like apple, i like to make application'

In [72]:
import re

In [74]:
re.search('[0-9]{4}', test).group()

AttributeError: 'NoneType' object has no attribute 'group'

In [75]:
solder = ' 1 2 3'
re.split(pattern='\s', string = solder)

['', '1', '2', '3']

In [76]:
tele_num = '1234567890'

In [77]:
len(tele_num)

10

In [79]:
ax  = re.match(pattern='\d{10}', string = tele_num)
ax

In [80]:
print(type(ax))

<class 're.Match'>

In [81]:
"match" if bool(ax) else "Unmatch"

'match'

In [82]:
ax.start()

0

In [83]:
ax.end()

10

In [89]:
ax.group()[ax.start()]

'1'

In [90]:
ax.group()

'1234567890'

In [91]:
ax.span()

(0, 10)

In [92]:
tele_num_spaces = "123 456 7890"

In [93]:
re.match(pattern='\d{3}\s\d{3}\s\d{4}', string = tele_num_spaces)

In [94]:
re.match(pattern='\d{3}\s?\d{3}\s?\d{4}', string = '1234567890')

In [95]:
tele_num_space_paren_dash = '(123) 456-7890'

In [101]:
re.match(pattern='(\()?\d{3}(\))?\s\d{3}\-\d{4}', string = tele_num_space_paren_dash)

In [104]:
re.match(pattern='\(?\d{3}\)?\s?\d{3}\s?-?\d{4}', string = '(123) 456-7890')

In [112]:
re.match(pattern='\(?\d{3}\)?\s?\d{3}\s?-?\d{4}', string = '1234567890')

In [116]:
rev = '01011'
rev2 = '010-11'
re.match(pattern='\d{3}(\-)?\d{2}', string = rev2)

In [117]:
core = ['1234567890','(123) 456-7890','+1 (123) 456-7890']

In [129]:
for i in core:
    ax = re.match(pattern='(\+\d\s)?(\()?\d{3}(\)\s)?\d{3}(\-)?\d{4}', string = str(i))
    print(i if bool(ax) else "unmatched")

1234567890
(123) 456-7890
+1 (123) 456-7890

In [130]:
p = re.compile('\d{10}')
p.match('1234567890')

In [131]:
def my_exp(x):
    return x ** 2

def my_exp_c(x, n):
    return x ** n

In [132]:
l_my_exp = lambda x : x ** 2
l_my_exp_c = lambda x, n : x ** n

In [133]:
my_exp(4)

16

In [134]:
my_exp_c(2,4)

16

In [135]:
l_my_exp(4)

16

In [136]:
l_my_exp_c(2, 4)

16

In [137]:
import pandas as pd

In [138]:
df = pd.DataFrame({
    'a' : [10, 20, 30],
    'b' : [20, 30, 40]
})

In [139]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [140]:
df['a'] ** 2

0    100
1    400
2    900
Name: a, dtype: int64

In [141]:
df['a'].apply(my_exp)

0    100
1    400
2    900
Name: a, dtype: int64

In [142]:
df['a'].apply(l_my_exp)

0    100
1    400
2    900
Name: a, dtype: int64

In [143]:
df['a'] ** 10

0        10000000000
1     10240000000000
2    590490000000000
Name: a, dtype: int64

In [144]:
df['a'].apply(my_exp_c, n = 10)

0        10000000000
1     10240000000000
2    590490000000000
Name: a, dtype: int64

In [145]:
df['a'].apply(l_my_exp_c, n = 10)

0        10000000000
1     10240000000000
2    590490000000000
Name: a, dtype: int64

In [146]:
printme = lambda x : print(x)

In [148]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [147]:
df.apply(printme)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

In [149]:
df.apply(printme, axis = 1)

a    10
b    20
Name: 0, dtype: int64
a    20
b    30
Name: 1, dtype: int64
a    30
b    40
Name: 2, dtype: int64

0    None
1    None
2    None
dtype: object

In [150]:
print(df['a'])

0    10
1    20
2    30
Name: a, dtype: int64

In [151]:
df.columns

Index(['a', 'b'], dtype='object')

In [152]:
df['a']

0    10
1    20
2    30
Name: a, dtype: int64

In [153]:
df['b']

0    20
1    30
2    40
Name: b, dtype: int64

In [154]:
def getmean(x):
    sum = 0
    for i in x:
        sum += i
    return sum / len(x)

In [155]:
df.apply(getmean)

a    20.0
b    30.0
dtype: float64

In [156]:
df.apply(getmean, axis =1 )

0    15.0
1    25.0
2    35.0
dtype: float64

In [157]:
import numpy as np

In [158]:
df.apply(np.mean)

a    20.0
b    30.0
dtype: float64

In [159]:
df.apply(np.mean, axis = 1)

0    15.0
1    25.0
2    35.0
dtype: float64

In [161]:
import seaborn as sns

In [162]:
df = sns.load_dataset("titanic")

In [163]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [165]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [166]:
countmissing = lambda x : pd.isnull(x).sum()

In [167]:
def count_missing(x):
    null_vec = pd.isnull(x)
    null_count = np.sum(null_vec)
    return null_count

In [168]:
df.apply(countmissing)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [169]:
df.apply(count_missing)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [170]:
getnanp = lambda x : pd.isnull(x).sum() / x.size

In [174]:
def prop_missing(x):
    num = count_missing(x)
    dem = x.size
    return num / dem

In [172]:
df.apply(getnanp)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [175]:
df.apply(prop_missing)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [176]:
def prop_complete(x):
    return 1 - prop_missing(x)

In [177]:
nonnanp = lambda x : 1 - (pd.isnull(x).sum() / x.size)

In [178]:
df.apply(prop_complete)

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
dtype: float64

In [179]:
df.apply(nonnanp)

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
dtype: float64

In [180]:
df['missing'] = df.apply(count_missing, axis = 1)
df['missing_l'] = df.apply(lambda x : (pd.isnull(x).sum()), axis = 1)

In [181]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,missing,missing_l
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,1,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,1,1
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,0,0
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,2,2
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,0,0
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,1,1

In [182]:
df[df['missing'] >= 2]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,missing,missing_l
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True,2,2
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True,2,2
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True,2,2
26,0,3,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True,2,2
28,1,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True,2,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True,2,2
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False,2,2
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True,2,2
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True,2,2
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,2,2

In [183]:
df[df['missing_l'] >= 2]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,missing,missing_l
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True,2,2
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True,2,2
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True,2,2
26,0,3,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True,2,2
28,1,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True,2,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True,2,2
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False,2,2
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True,2,2
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True,2,2
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,2,2

In [184]:
df['missing'].value_counts()

1    549
0    182
2    160
Name: missing, dtype: int64

In [185]:
import pandas as pd

In [186]:
df = pd.read_csv('../data/gapminder.tsv', sep='\t')

In [187]:
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [188]:
df.groupby('year').lifeExp.mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [189]:
years = df['year'].unique()

In [191]:
years

array([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
       2007], dtype=int64)

In [192]:
print(years)

[1952 1957 1962 1967 1972 1977 1982 1987 1992 1997 2002 2007]

In [193]:
y1952 = df[df['year'] == 1952]['lifeExp'].mean()

In [194]:
y1952

49.057619718309866

In [195]:
y1957 = df[df['year'] == 1957]['lifeExp'].mean()

In [196]:
y1962 = df[df['year'] == 1962]['lifeExp'].mean()

In [197]:
y2007 = df[df['year'] == 2007]['lifeExp'].mean()

In [198]:
df = pd.DataFrame({
    'year' : [1952, 1957, 1962, 2007],
    '' : [y1952, y1957, y1962, y2007
         ]
})

In [199]:
df

   year
0  1952  49.057620
1  1957  51.507401
2  1962  53.609249
3  2007  67.007423

In [200]:
def my_mean(x):
    sum = 0
    for i in x:
        sum += i
    return sum / len(x)

In [203]:
df

   year
0  1952  49.057620
1  1957  51.507401
2  1962  53.609249
3  2007  67.007423

In [204]:
df = pd.read_csv('../data/gapminder.tsv', sep = '\t')

In [205]:
df.groupby('year').lifeExp.apply(my_mean)

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [206]:
df.groupby('year').lifeExp.mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [208]:
def diff_my_mean(x, n):
    sum = 0
    for i in x:
        sum += i
    return (sum / len(x)) - n

In [209]:
df.groupby('year').lifeExp.apply(diff_my_mean, n = df['lifeExp'].mean())

year
1952   -10.416820
1957    -7.967038
1962    -5.865190
1967    -3.796150
1972    -1.827053
1977     0.095718
1982     2.058758
1987     3.738173
1992     4.685899
1997     5.540237
2002     6.220483
2007     7.532983
Name: lifeExp, dtype: float64

In [210]:
df.groupby('year').lifeExp.agg([np.count_nonzero, np.mean, np.std])

      count_nonzero       mean        std
year
1952            142  49.057620  12.225956
1957            142  51.507401  12.231286
1962            142  53.609249  12.097245
1967            142  55.678290  11.718858
1972            142  57.647386  11.381953
1977            142  59.570157  11.227229
1982            142  61.533197  10.770618
1987            142  63.212613  10.556285
1992            142  64.160338  11.227380
1997            142  65.014676  11.559439
2002            142  65.694923  12.279823
2007            142  67.007423  12.073021

In [211]:
df.groupby('year').agg({'lifeExp':'mean','pop':'median','gdpPercap':'median'})

        lifeExp         pop    gdpPercap
year
1952  49.057620   3943953.0  1968.528344
1957  51.507401   4282942.0  2173.220291
1962  53.609249   4686039.5  2335.439533
1967  55.678290   5170175.5  2678.334740
1972  57.647386   5877996.5  3339.129407
1977  59.570157   6404036.5  3798.609244
1982  61.533197   7007320.0  4216.228428
1987  63.212613   7774861.5  4280.300366
1992  64.160338   8688686.5  4386.085502
1997  65.014676   9735063.5  4781.825478
2002  65.694923  10372918.5  5319.804524
2007  67.007423  10517531.0  6124.371108

In [216]:
z_score = lambda x : (x - x.mean()) / x.std()

In [217]:
df.groupby('year').lifeExp.transform(z_score)

0      -1.656854
1      -1.731249
2      -1.786543
3      -1.848157
4      -1.894173
          ...
1699   -0.081621
1700   -0.336974
1701   -1.574962
1702   -2.093346
1703   -1.948180
Name: lifeExp, Length: 1704, dtype: float64

In [214]:
def my_zscore(x):
    return (x - x.mean()) / x.std()

In [215]:
df.groupby('year').lifeExp.transform(my_zscore)

0      -1.656854
1      -1.731249
2      -1.786543
3      -1.848157
4      -1.894173
          ...
1699   -0.081621
1700   -0.336974
1701   -1.574962
1702   -2.093346
1703   -1.948180
Name: lifeExp, Length: 1704, dtype: float64

In [218]:
printme = lambda x : print(x)

In [219]:
df.apply(printme)

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object
0         Asia
1         Asia
2         Asia
3         Asia
4         Asia
         ...
1699    Africa
1700    Africa
1701    Africa
1702    Africa
1703    Africa
Name: continent, Length: 1704, dtype: object
0       1952
1       1957
2       1962
3       1967
4       1972
        ...
1699    1987
1700    1992
1701    1997
1702    2002
1703    2007
Name: year, Length: 1704, dtype: int64
0       28.801
1       30.332
2       31.997
3       34.020
4       36.088
         ...
1699    62.351
1700    60.377
1701    46.809
1702    39.989
1703    43.487
Name: lifeExp, Length: 1704, dtype: float64
0        8425333
1        9240934
2       10267083
3       11537966
4       13079460
          ...
1699     9216418
1700    10704340
1701    11404948
1702    11926563
1703    12311143
Name: pop, Length: 1704, dtype: int64
0       779.445314
1       820.853030
2       853.100710
3       836.197138
4       739.981106
           ...
1699    706.157306
1700    693.420786
1701    792.449960
1702    672.038623
1703    469.709298
Name: gdpPercap, Length: 1704, dtype: float64

country      None
continent    None
year         None
lifeExp      None
pop          None
gdpPercap    None
dtype: object

In [220]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [222]:
df.groupby('year')['lifeExp'].transform(my_zscore).head()

0   -1.656854
1   -1.731249
2   -1.786543
3   -1.848157
4   -1.894173
Name: lifeExp, dtype: float64

In [223]:
df.shape

(1704, 6)

In [226]:
grp = df.groupby('year')['lifeExp'].transform(my_zscore)

In [227]:
grp.shape

(1704,)

In [228]:
df = sns.load_dataset("tips").sample(10, random_state = 42)

In [229]:
df

     total_bill   tip     sex smoker   day    time  size
24        19.82  3.18    Male     No   Sat  Dinner     2
6          8.77  2.00    Male     No   Sun  Dinner     2
153       24.55  2.00    Male     No   Sun  Dinner     4
211       25.89  5.16    Male    Yes   Sat  Dinner     4
198       13.00  2.00  Female    Yes  Thur   Lunch     2
176       17.89  2.00    Male    Yes   Sun  Dinner     2
192       28.44  2.56    Male    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
9         14.78  3.23    Male     No   Sun  Dinner     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [231]:
df.loc[np.random.permutation(df.index)[:4], 'total_bill'] = np.NAN

In [232]:
df

     total_bill   tip     sex smoker   day    time  size
24        19.82  3.18    Male     No   Sat  Dinner     2
6           NaN  2.00    Male     No   Sun  Dinner     2
153       24.55  2.00    Male     No   Sun  Dinner     4
211       25.89  5.16    Male    Yes   Sat  Dinner     4
198       13.00  2.00  Female    Yes  Thur   Lunch     2
176         NaN  2.00    Male    Yes   Sun  Dinner     2
192       28.44  2.56    Male    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
9           NaN  3.23    Male     No   Sun  Dinner     2
101         NaN  3.00  Female    Yes   Fri  Dinner     2

In [233]:
df.groupby('sex').count()

        total_bill  tip  smoker  day  time  size
sex
Male             4    7       7    7     7     7
Female           2    3       3    3     3     3

In [234]:
def fill_na_mean(x):
    return x.fillna(x.mean())

In [235]:
fill_na = lambda x : x.fillna(x.mean(
))

In [242]:
%%timeit
def fill_na_mean(x):
    return x.fillna(x.mean())

60.7 ns  1 ns per loop (mean  std. dev. of 7 runs, 10,000,000 loops each)

In [241]:
%%timeit
fill_na = lambda x : x.fillna(x.mean(
))

60.6 ns  1.77 ns per loop (mean  std. dev. of 7 runs, 10,000,000 loops each)

In [238]:
df['fill_total_bill'] = df.groupby('sex').total_bill.transform(fill_na_mean)

In [239]:
df['fill_total_bill2'] = df.groupby('sex').total_bill.transform(fill_na
                                                            )

In [240]:
df

,total_bill,tip,sex,smoker,day,time,size,fill_total_bill,fill_total_bill2
24,19.82,3.18,Male,No,Sat,Dinner,2,19.820,19.820
6,NaN,2.00,Male,No,Sun,Dinner,2,24.675,24.675
153,24.55,2.00,Male,No,Sun,Dinner,4,24.550,24.550
211,25.89,5.16,Male,Yes,Sat,Dinner,4,25.890,25.890
198,13.00,2.00,Female,Yes,Thur,Lunch,2,13.000,13.000
176,NaN,2.00,Male,Yes,Sun,Dinner,2,24.675,24.675
192,28.44,2.56,Male,Yes,Thur,Lunch,2,28.440,28.440
124,12.48,2.52,Female,No,Thur,Lunch,2,12.480,12.480
9,NaN,3.23,Male,No,Sun,Dinner,2,24.675,24.675
101,NaN,3.00,Female,Yes,Fri,Dinner,2,12.740,12.740

In [243]:
df = sns.load_dataset("tips")

In [244]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [245]:
df.shape

(244, 7)

In [246]:
df['size'].value_counts()

2    156
3     38
4     37
5      5
1      4
6      4
Name: size, dtype: int64

In [250]:
df.groupby('size').filter(lambda x : x['size'].count() >= 30)

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[231 rows x 7 columns]

In [247]:
dfu = df.groupby('size').filter(lambda x : x['size'].count() >= 30)['size'].value_counts()

In [248]:
dfu

2    156
3     38
4     37
Name: size, dtype: int64